In [1]:
import pandas as pd

In [2]:
bank_churn_messy_account_info = pd.read_excel("Bank Customer Churn Data/Bank_Churn_Messy.xlsx",
                                 sheet_name=1)
bank_churn_messy_account_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10002 entries, 0 to 10001
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CustomerId      10002 non-null  int64
 1   Balance         10002 non-null  object
 2   NumOfProducts   10002 non-null  int64
 3   HasCrCard       10002 non-null  object
 4   Tenure          10002 non-null  int64
 5   IsActiveMember  10002 non-null  object
 6   Exited          10002 non-null  int64
dtypes: int64(4), object(3)
memory usage: 547.1+ KB

In [3]:
bank_churn_messy_customer_info = pd.read_excel("Bank Customer Churn Data/Bank_Churn_Messy.xlsx",
                                 sheet_name=0)
bank_churn_messy_customer_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10001 entries, 0 to 10000
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       10001 non-null  int64
 1   Surname          9998 non-null   object
 2   CreditScore      10001 non-null  int64
 3   Geography        10001 non-null  object
 4   Gender           10001 non-null  object
 5   Age              9998 non-null   float64
 6   Tenure           10001 non-null  int64
 7   EstimatedSalary  10001 non-null  object
dtypes: float64(1), int64(3), object(4)
memory usage: 625.2+ KB

In [4]:
bank_churn_df = bank_churn_messy_account_info.merge(bank_churn_messy_customer_info,
                                    how='left',
                                    on='CustomerId')
bank_churn_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10004 entries, 0 to 10003
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       10004 non-null  int64
 1   Balance          10004 non-null  object
 2   NumOfProducts    10004 non-null  int64
 3   HasCrCard        10004 non-null  object
 4   Tenure_x         10004 non-null  int64
 5   IsActiveMember   10004 non-null  object
 6   Exited           10004 non-null  int64
 7   Surname          10001 non-null  object
 8   CreditScore      10004 non-null  int64
 9   Geography        10004 non-null  object
 10  Gender           10004 non-null  object
 11  Age              10001 non-null  float64
 12  Tenure_y         10004 non-null  int64
 13  EstimatedSalary  10004 non-null  object
dtypes: float64(1), int64(6), object(7)
memory usage: 1.1+ MB

In [5]:
bank_churn_df = bank_churn_df.drop("Tenure_y",axis=1).rename({"Tenure_x":"Tenure"},axis=1).drop_duplicates()
bank_churn_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 10000
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       10000 non-null  int64
 1   Balance          10000 non-null  object
 2   NumOfProducts    10000 non-null  int64
 3   HasCrCard        10000 non-null  object
 4   Tenure           10000 non-null  int64
 5   IsActiveMember   10000 non-null  object
 6   Exited           10000 non-null  int64
 7   Surname          9997 non-null   object
 8   CreditScore      10000 non-null  int64
 9   Geography        10000 non-null  object
 10  Gender           10000 non-null  object
 11  Age              9997 non-null   float64
 12  EstimatedSalary  10000 non-null  object
dtypes: float64(1), int64(5), object(7)
memory usage: 1.1+ MB

In [6]:
bank_churn_df.head()

,CustomerId,Balance,NumOfProducts,HasCrCard,Tenure,IsActiveMember,Exited,Surname,CreditScore,Geography,Gender,Age,EstimatedSalary
0,15634602,€0.0,1,Yes,2,Yes,1,Hargrave,619,FRA,Female,42.0,€101348.88
2,15647311,€83807.86,1,Yes,1,Yes,0,Hill,608,Spain,Female,41.0,€112542.58
3,15619304,€159660.8,3,No,8,No,1,Onio,502,French,Female,42.0,€113931.57
4,15701354,€0.0,2,No,1,No,0,Boni,699,FRA,Female,39.0,€93826.63
5,15737888,€125510.82,1,Yes,2,Yes,0,Mitchell,850,Spain,Female,43.0,€79084.1

In [7]:
bank_churn_df["Balance"] = bank_churn_df["Balance"].str.replace("€","").astype("float")
bank_churn_df["EstimatedSalary"] = bank_churn_df["EstimatedSalary"].str.replace("€","").astype("float")

In [8]:
bank_churn_df.to_csv("Bank Customer Churn Data/Prepared Data/bank_churn_df.csv")